tutorials/combustion/dieselFoam/aachenBomb/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-10 0 -10)
    (-10 0 10)
    (10 0 10)
    (10 0 -10)
    (-10 100 -10)
    (-10 100 10)
    (10 100 10)
    (10 100 -10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (41 41 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (2 6 5 1)
            (0 4 7 3)
            (0 1 5 4)
            (4 5 6 7)
            (7 6 2 3)
            (3 2 1 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
