tutorials/combustion/dieselFoam/aachenBomb/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// ************************************************************************* //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField       uniform 5e+06;

boundaryField
{
    walls
    {
        type            buoyantPressure;
        value           uniform 5e+06;
    }
}

// ************************************************************************* //
