tutorials/combustion/dieselFoam/aachenBomb/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      O2;
}
// ************************************************************************* //

dimensions          [ 0 0 0 0 0 0 0 ];

internalField       uniform 0.234;

boundaryField
{
    walls
    {
        type                zeroGradient;
    }
}

// ************************************************************************* //
